export const en = {
  asciilong:
    "<:cross:1281580669373382686> The ASCII text is too long (over 8m characters)",
  asciiError:
    "<:cross:1281580669373382686> An error occurred while generating the ASCII text",
  asciiSuccess:
    "<:check:1281579844089675810> ASCII text generated successfully",
  automod_ison:
    "<:cross:1281580669373382686> This Automod rule is already set **on*\n-# (either the maximum number of rules has been reached or there is an error).",
  automod_loading: "<:ellipsis:1281582569116143656> Loading your Automod rule",
  automod_noperms:
    "<:cross:1281580669373382686> Looks like I do **not** have permission to do that. Please grant permission **Manage Server** or **Administrator** for me",
  automod_success1:
    "<:check:1281579844089675810> Your Automod rule has been created! All swears will be blocked",
  automod_success2:
    "<:check:1281579844089675810> Your Automod rule has been created! All messages containing the word `${word}` will be blocked",
  automod_success3:
    "<:check:1281579844089675810> Your Automod rule has been created! All messages suspected of spam will be blocked",
  automod_success4:
    "<:check:1281579844089675810> Your Automod rule has been created! All messages suspected of mention spam will be blocked",
  ben: "Ben",
  benNo: "No.",
  benYes: "Yes.",
  yes: "Yes",
  no: "No",
  beta: "<:dev:1297262773826486382> Not available yet: Still under development",
  boosts: "Boosts",
  btnisntfunc: "The button doesn't work? Click the link instead! ~>",
  catfail:
    "<:cross:1281580669373382686> Unfortunately, the cat photo couldn't be generated",
  cattitle: "<:check:1281579844089675810> Generated random cat photo",
  cooldown:
    "<:cross:1281580669373382686> Please wait, you're on cooldown for `${command.data.name}`. You can use it again in <t:${expiredTimestamp}:R>",
  createdAt: "Created",
  dayssincelaunch: "Days since launch",
  dogfail:
    "<:cross:1281580669373382686> Unfortunately, the dog photo couldn't be generated",
  dogtitle: "<:check:1281579844089675810> Generated random dog photo",
  editor: "Editor",
  emoji: "Emoji",
  gameApp: "<:cross:1281580669373382686> Apps can't play Rock Paper Scissors",
  gameOnPOnly: "**{player}** and **{opponent}** are playing!",
  gameTie: "Tie",
  gameYS: "<:cross:1281580669373382686> You can't play a game yourself",
  high: "High",
  host: "Host",
  interr:
    "<:cross:1281580669373382686> An error occurred while running this command",
  isApp: "<:cross:1281580669373382686> You can't run that with apps!",
  joinedAt: "Joined",
  low: "Low",
  luckyrandom: "<:luo:1270401166731382867> You are lucky!",
  luoxiaohei: "Luo Xiaohei",
  luoxiaoheiadd: "Add",
  luoxiaoheidesc:
    "🎋 Thank you for **adding** Luo Xiaohei to home! ≽^•⩊•^≼ What does Luo Xiaohei can do?\n- **😂 Get your daily dose of trivia: Use /fact to generate a random interesting fact!**\n- **🐾 Cat & Dog Lovers rejoice! Use /cat for adorable cat pictures and /dog for pawsome pup pics!**\n- **🎲 Feeling lucky? Test your luck with /luck and see if you can match the random & result values!**\n- **🖼️ Show off your profile: Get your or someone else's profile picture with /profile.**\n- **⏲️ Create custom timestamps: Design your own timestamp format messages with /timestamp.**\n- **👤User Info at your fingertips: Use /whois to see detailed information about any user.**\n**...and more! *More features are coming soon, meow!***\n\n*You can install Luo Xiaohei as User, but some commands will being not to show, which means they are for only guilds. No, Luo doesn't ask you to log in your account.*",
  member: "Member",
  members: "Members",
  mid: "Middle",
  ms: "ms",
  name: "Name",
  nope: "No",
  owner: "Owner",
  pinging: "<:ellipsis:1281582569116143656> Pinging...",
  printdate: "Print Date",
  purgeSuccess:
    "<:check:1281579844089675810> Successfully purged some amongst `${fetchedMessages}` messages",
  purge_nomsgs:
    "<:cross:1281580669373382686> Nothing to purge messages. Messages older than 2 weeks can't be purged",
  purge_noperms:
    "<:cross:1281580669373382686> Looks like I do **not** have permission to do that. Please grant permission **Manage Messages** or **Administrator** for me",
  random: "Random",
  release: "Release",
  result: "Result",
  roles: "Roles",
  rps: "🎮 Rock Paper Scissors",
  rpsDesc: "Choose your option 💫",
  rpsP: "Paper",
  rpsPick: "You picked {emoji}",
  rpsR: "Rock",
  rpsS: "Scissors",
  rpsTimeout:
    "<:cross:1281580669373382686> **{opponent}** didn't pick the option for over 60 seconds - The game is cancelled",
  rpsWin: "**{player}** has won the game!",
  solution: "Solution",
  srvCreation: "Creation Date",
  time_1desc: "Time",
  time_1label: "1st January 1970",
  time_2desc: "Full time",
  time_2label: "1st January 1970, 00:00",
  time_3desc: "Digital date",
  time_3label: "Thursday, 1st January 1970, 00:00",
  time_4desc: "Date",
  time_4label: "55 years ago",
  time_5desc: "Date and time",
  time_6desc: "Full date",
  time_7desc: "Elapsed time",
  timeplaceholder: "Select time format",
  tttGOver: "Game Over",
  tttStatus: "Status",
  tttTimeout: "**{opponent}** was taking too long to choose",
  tttTitle: "Tic Tac Toe",
  tttTurn: "{emoji} | Turn: **{player}**",
  tttWin: "{emoji} | **{player}** has won!",
  unluckyrandom: "<:luo:1270401166731382867> So unlucky...",
  userNotFound: "<:cross:1281580669373382686> Unknown user",
  veriflvl: "Verification Level",
  veryhigh: "Very High",
  wordleErr:
    "<:cross:1281580669373382686> Oh no, an error has showed. This is because:\nThe **answer** hasn't made yet! Always seen code as `404`.\nSpecified invalid date\nToo many requests, wait for some time and try again",
  joinusdesc:
    '**≽^•⩊•^≼ | That\'s right! You are in right place! This is official server with discord app named "Luo Xiaohei"**',
  viewBalance:
    "<:wallet:1297262403691745280> {user} has on their wallet: **{balance}¥**",
  viewSelfBalance: "<:wallet:1297262403691745280> Your balance: **{balance}¥**",
  inventoryTitle: "{user}'s Inventory",
  inventoryEmpty: "<:cross:1281580669373382686> This inventory is empty!",
  transferSuccess:
    "<:check:1281579844089675810> Successfully transferred **{amount}¥** to **{user}**",
  transferInsufficientBalance:
    "<:cross:1281580669373382686> You don't have enough balance to transfer",
  transferInvalidAmount: "<:cross:1281580669373382686> Invalid amount",
  transferConfirmTitle: "Confirm Transfer",
  transferConfirmDescription:
    "Are you sure you want to transfer **{amount}¥** to **{user}**?",
  transferCancelled: "<:cross:1281580669373382686> Transfer cancelled",
  transferTimeout: "<:cross:1281580669373382686> Transfer timed out",
  transferSameUser:
    "<:cross:1281580669373382686> You can't transfer money to yourself",
  transferError:
    "<:cross:1281580669373382686> An error occurred while transferring money",
  transferBot: "<:cross:1281580669373382686> You can't transfer money to bots",
  itemNotFound: "<:cross:1281580669373382686> Item not found",
  notEnoughBalance:
    "<:cross:1281580669373382686> You don't have enough balance to buy this item",
  itemPurchased:
    "<:check:1281579844089675810> Successfully purchased **{item}**",
  ldNoUsersFound: "No users found on the leaderboard",
  ldTitle: "Currency Leaderboard",
  ldDescription: "Top 10 richest users:",
  inventoryError:
    "<:cross:1281580669373382686> An error occurred while fetching the inventory",
  purchaseError:
    "<:cross:1281580669373382686> An error occurred while purchasing the item",
  itemDisabled:
    "<:cross:1281580669373382686> This item is currently not available for purchase",
  isRegistered: "Registered?",
  balance: "Balance",
  databaseError:
    "An error occurred while fetching user data. Please try again later",
  inventorySize:
    "Your inventory is full. You can't buy more items until you interact items for more space",
  inventoryFull: "Inventory is full",
  itemNotInInventory: "You don't have this item in your inventory",
  notEnoughItems: "You don't have enough of this item to sell",
  saleError: "An error occurred while selling the item. Please try again later",
  itemSold: "Item Sold",
  soldAmount: "Sold Amount",
  soldPrice: "Sold Price",
  itemSoldDescription: "You sold {amount}x {item} for {price}¥",
  itemPurchasedDescription: "You bought {amount}x {item} for {price}¥",
  anonymousEnabled: "You are now anonymous on the leaderboard",
  anonymousDisabled: "You are no longer anonymous on the leaderboard",
  servercount: "Server Count",
  membercount: "Member Count",
  no_reason: "No reason provided",
  cannot_ban_user:
    "<:cross:1281580669373382686> I cannot ban this user. Please check my permissions.",
  cannot_ban_higher_role:
    "<:cross:1281580669373382686> You cannot ban someone with an equal or higher role.",
  banned_dm_title: "You have been banned",
  banned_dm_description: "You have been banned from {server}\nReason: {reason}",
  ban_success:
    "<:check:1281579844089675810> Successfully banned {user}\nReason: {reason}\nDeleted messages from the last {days} days",
  ban_failed:
    "<:cross:1281580669373382686> Failed to ban the user. Please check my permissions and try again",
  user_not_in_server:
    "<:cross:1281580669373382686> This user is not in the server",
  cannot_kick_user:
    "<:cross:1281580669373382686> I cannot kick this user. Please check my permissions",
  cannot_kick_higher_role:
    "<:cross:1281580669373382686> You cannot kick someone with an equal or higher role",
  kicked_dm_title: "You have been kicked",
  kicked_dm_description: "You have been kicked from {server}\nReason: {reason}",
  kick_success:
    "<:check:1281579844089675810> Successfully kicked {user}\nReason: {reason}",
  kick_failed:
    "<:cross:1281580669373382686> Failed to kick the user. Please check my permissions and try again",
  invalid_duration_format:
    "<:cross:1281580669373382686> Invalid duration format. Use format like: 1m, 1h, 1d",
  duration_too_long:
    "<:cross:1281580669373382686> Timeout duration cannot exceed 28 days",
  cannot_timeout_user:
    "<:cross:1281580669373382686> I cannot timeout this user",
  cannot_timeout_higher_role:
    "<:cross:1281580669373382686> You cannot timeout a member with a higher or equal role",
  timeout_dm_title: "You have been timed out",
  timeout_dm_description:
    "You have been timed out in {server}\nDuration: {duration}\nReason: {reason}",
  timeout_success:
    "<:check:1281579844089675810> Successfully timed out {user} for {duration}\nReason: {reason}",
  timeout_failed: "<:cross:1281580669373382686> Failed to timeout the user",
};

export const ru = {
  asciilong:
    "<:cross:1281580669373382686> ASCII-текст слишком длинный (более 8m символов)",
  asciiError:
    "<:cross:1281580669373382686> Произошла ошибка при генерации ASCII-текста",
  asciiSuccess: "<:check:1281579844089675810> ASCII-текст успешно сгенерирован",
  automod_ison:
    "<:cross:1281580669373382686> Это правило Автомодерации уже **включено**\n-# (либо достигнуто максимальное количество правил, либо произошла ошибка).",
  automod_loading:
    "<:ellipsis:1281582569116143656> Загрузка вашего правила Автомодерации",
  automod_noperms:
    "<:cross:1281580669373382686> Похоже, у меня **нет** разрешения на это. Пожалуйста, предоставьте мне разрешение **Управлять сервером** или **Администратор**",
  automod_success1:
    "<:check:1281579844089675810> Ваше правило Автомодерации создано! Все ругательства будут заблокированы",
  automod_success2:
    "<:check:1281579844089675810> Ваше правило Автомодерации создано! Все сообщения, содержащие слово `${word}`, будут заблокированы",
  automod_success3:
    "<:check:1281579844089675810> Ваше правило Автомодерации создано! Все сообщения, подозреваемые в спаме, будут заблокированы",
  automod_success4:
    "<:check:1281579844089675810> Ваше правило Автомодерации создано! Все сообщения, подозреваемые в спаме упоминаний, будут заблокированы",
  ben: "Бен",
  benNo: "Нет.",
  benYes: "Да.",
  yes: "Да",
  no: "Нет",
  beta: "<:dev:1297262773826486382> Пока недоступно: В разработке",
  boosts: "Бусты",
  btnisntfunc: "Кнопка не работает? Нажмите на ссылку! ~>",
  catfail:
    "<:cross:1281580669373382686> К сожалению, фото кота не удалось сгенерировать",
  cattitle: "<:check:1281579844089675810> Сгенерировано случайное фото кота",
  cooldown:
    "<:cross:1281580669373382686> Пожалуйста, подождите, у вас перезарядка для `${command.data.name}`. Вы сможете использовать его снова <t:${expiredTimestamp}:R>",
  createdAt: "Создано",
  dayssincelaunch: "Дней с запуска",
  dogfail:
    "<:cross:1281580669373382686> К сожалению, фото собаки не удалось сгенерировать",
  dogtitle: "<:check:1281579844089675810> Сгенерировано случайное фото собаки",
  editor: "Редактор",
  emoji: "Эмодзи",
  gameApp:
    "<:cross:1281580669373382686> Приложения не могут играть в Камень Ножницы Бумага",
  gameOnPOnly: "**{player}** и **{opponent}** играют!",
  gameTie: "Ничья",
  gameYS:
    "<:cross:1281580669373382686> Вы не можете играть в игру сами с собой",
  high: "Высокий",
  host: "Хост",
  interr:
    "<:cross:1281580669373382686> Произошла ошибка при выполнении этой команды",
  isApp:
    "<:cross:1281580669373382686> Вы не можете запустить это с приложениями!",
  joinedAt: "Присоединился",
  low: "Низкий",
  luckyrandom: "<:luo:1270401166731382867> Вам повезло!",
  luoxiaohei: "Ло Сяохэй",
  luoxiaoheiadd: "Добавить",
  luoxiaoheidesc:
    "🎋 Спасибо за **добавление** Ло Сяохэя в дом! ≽^•⩊•^≼ Что умеет Ло Сяохэй?\n- **😂 Получите свою ежедневную дозу интересных фактов: Используйте /fact, чтобы сгенерировать случайный интересный факт!**\n- **🐾 Любители кошек и собак, радуйтесь! Используйте /cat для милых фотографий кошек и /dog для очаровательных фотографий щенков!**\n- **🎲 Чувствуете себя удачливым? Проверьте свою удачу с помощью /luck и посмотрите, сможете ли вы совпасть со случайными значениями!**\n- **🖼️ Покажите свой профиль: Получите свою или чью-то еще фотографию профиля с помощью /profile.**\n- **⏲️ Создавайте пользовательские метки времени: Разработайте свой собственный формат сообщений с метками времени с помощью /timestamp.**\n- **👤Информация о пользователе под рукой: Используйте /whois, чтобы увидеть подробную информацию о любом пользователе.**\n**...и многое другое! *Скоро появятся новые функции, мяу!***\n\n*Вы можете установить Ло Сяохэя как пользователя, но некоторые команды не будут отображаться, что означает, что они предназначены только для серверов. Нет, Ло не просит вас входить в свою учетную запись.*",
  member: "Участник",
  members: "Участники",
  mid: "Средний",
  ms: "мс",
  name: "Имя",
  nope: "Нет",
  owner: "Владелец",
  pinging: "<:ellipsis:1281582569116143656> Пингую...",
  printdate: "Дата печати",
  purgeSuccess:
    "<:check:1281579844089675810> Успешно очищено несколько из `${fetchedMessages}` сообщений",
  purge_nomsgs:
    "<:cross:1281580669373382686> Нечего очищать. Сообщения старше 2 недель не могут быть очищены",
  purge_noperms:
    "<:cross:1281580669373382686> Похоже, у меня **нет** разрешения на это. Пожалуйста, предоставьте мне разрешение **Управлять сообщениями** или **Администратор**",
  random: "Случайный",
  release: "Релиз",
  result: "Результат",
  roles: "Роли",
  rps: "🎮 Камень Ножницы Бумага",
  rpsDesc: "Выберите свой вариант 💫",
  rpsP: "Бумага",
  rpsPick: "Вы выбрали {emoji}",
  rpsR: "Камень",
  rpsS: "Ножницы",
  rpsTimeout:
    "<:cross:1281580669373382686> **{opponent}** не выбрал вариант в течение 60 секунд - Игра отменена",
  rpsWin: "**{player}** выиграл игру!",
  solution: "Решение",
  srvCreation: "Дата создания",
  time_1desc: "Время",
  time_1label: "1 января 1970",
  time_2desc: "Полное время",
  time_2label: "1 января 1970, 00:00",
  time_3desc: "Цифровая дата",
  time_3label: "Четверг, 1 января 1970, 00:00",
  time_4desc: "Дата",
  time_4label: "55 лет назад",
  time_5desc: "Дата и время",
  time_6desc: "Полная дата",
  time_7desc: "Прошедшее время",
  timeplaceholder: "Выберите формат времени",
  tttGOver: "Игра окончена",
  tttStatus: "Статус",
  tttTimeout: "**{opponent}** слишком долго выбирал",
  tttTitle: "Крестики-нолики",
  tttTurn: "{emoji} | Ход: **{player}**",
  tttWin: "{emoji} | **{player}** выиграл!",
  unluckyrandom: "<:luo:1270401166731382867> Так не повезло...",
  userNotFound: "<:cross:1281580669373382686> Неизвестный пользователь",
  veriflvl: "Уровень верификации",
  veryhigh: "Очень высокий",
  wordleErr:
    "<:cross:1281580669373382686> О нет, произошла ошибка. Это потому что:\nОтвет еще не создан! Всегда видно код как `404`.\nУказана неверная дата\nСлишком много запросов, подождите некоторое время и попробуйте снова",
  joinusdesc:
    '**≽^•⩊•^≼ | Верно! Вы в правильном месте! Это официальный сервер с дискорд-приложением под названием "Luo Xiaohei"**',
  viewBalance:
    "<:wallet:1297262403691745280> {user} имеет на своем кошельке: **{balance}¥**",
  viewSelfBalance: "<:wallet:1297262403691745280> Ваш баланс: **{balance}¥**",
  inventoryTitle: "Инвентарь {user}",
  inventoryEmpty: "<:cross:1281580669373382686> Этот инвентарь пуст!",
  transferSuccess:
    "<:check:1281579844089675810> Успешно переведено **{amount}¥** в **{user}**",
  transferInsufficientBalance:
    "<:cross:1281580669373382686> У вас недостаточно баланса для перевода",
  transferInvalidAmount: "<:cross:1281580669373382686> Неверное количество",
  transferConfirmTitle: "Подтверждение перевода",
  transferConfirmDescription:
    "Вы уверены, что хотите перевести **{amount}¥** в **{user}**?",
  transferCancelled: "<:cross:1281580669373382686> Перевод отменен",
  transferTimeout: "<:cross:1281580669373382686> Перевод просрочен",
  transferSameUser:
    "<:cross:1281580669373382686> Вы не можете перевести деньги себе",
  transferBot:
    "<:cross:1281580669373382686> Вы не можете перевести деньги ботам",
  transferError:
    "<:cross:1281580669373382686> Произошла ошибка при переводе денег",
  itemNotFound: "<:cross:1281580669373382686> Предмет не найден",
  notEnoughBalance:
    "<:cross:1281580669373382686> У вас недостаточно баланса для покупки этого предмета",
  itemPurchased: "<:check:1281579844089675810> Вы успешно купили **{item}**",
  ldNoUsersFound: "Никого нет на лидере",
  ldTitle: "Лидер по деньгам",
  ldDescription: "10 самых богатых пользователей:",
  inventoryError: "<:cross:1281580669373382686> Ошибка при получении инвентаря",
  purchaseError: "<:cross:1281580669373382686> Ошибка при покупке предмета",
  itemDisabled:
    "<:cross:1281580669373382686> Этот предмет в настоящее время недоступен для покупки",
  isRegistered: "Зарегистрирован?",
  balance: "Баланс",
  databaseError:
    "Произошла ошибка при получении данных пользователя. Пожалуйста, попробуйте позже",
  inventoryFull:
    "Ваш инвентарь заполнен. Вы не можете купить больше предметов, пока не взаимодействуете с предметами для получения большего места",
  inventorySize: "Размер инвентаря",
  itemNotInInventory:
    "<:cross:1281580669373382686> У вас нет этого предмета в вашем инвентаре",
  notEnoughItems:
    "<:cross:1281580669373382686> У вас недостаточно этого предмета для продажи",
  saleError:
    "Произошла ошибка при продаже предмета. Пожалуйста, попробуйте позже",
  itemSold: "Предмет продан",
  soldAmount: "Количество",
  soldPrice: "Цена",
  itemSoldDescription: "Ты продал(-а) {amount}x {item} за {price}¥",
  itemPurchasedDescription: "Вы успешно купили {amount}x {item} за {price}¥",
  anonymousEnabled: "Вы теперь анонимны на таблице лидеров",
  anonymousDisabled: "Вы больше не анонимны на таблице лидеров",
  servercount: "Количество серверов",
  membercount: "Количество участников",
  cannot_ban_user:
    "<:cross:1281580669373382686> Я не могу забанить этого пользователя. Пожалуйста, проверьте мои права",
  cannot_ban_higher_role:
    "<:cross:1281580669373382686> Вы не можете забанить кого-то с равной или более высокой ролью",
  ban_success:
    "<:check:1281579844089675810> Успешно забанен {user}\nПричина: {reason}\nУдалены сообщения за последние {days} дней",
  ban_failed:
    "<:cross:1281580669373382686> Не удалось забанить пользователя. Пожалуйста, проверьте мои права и попробуйте снова",
  user_not_in_server:
    "<:cross:1281580669373382686> Этот пользователь не находится на сервере",
  cannot_kick_user:
    "<:cross:1281580669373382686> Я не могу выгнать этого пользователя. Пожалуйста, проверьте мои права",
  cannot_kick_higher_role:
    "<:cross:1281580669373382686> Вы не можете выгнать кого-то с равной или более высокой ролью",
  kick_success:
    "<:check:1281579844089675810> Успешно выгнали {user}\nПричина: {reason}",
  kick_failed:
    "<:cross:1281580669373382686> Не удалось выгнать пользователя. Пожалуйста, проверьте мои права и попробуйте снова",
  invalid_duration_format:
    "<:cross:1281580669373382686> Неверный формат длительности. Используйте формат: 1m, 1h, 1d",
  duration_too_long:
    "<:cross:1281580669373382686> Длительность таймаута не может превышать 28 дней",
  cannot_timeout_user:
    "<:cross:1281580669373382686> Я не могу ограничить этого пользователя",
  cannot_timeout_higher_role:
    "<:cross:1281580669373382686> Вы не можете ограничить участника с более высокой или равной ролью",
  timeout_success:
    "<:check:1281579844089675810> Пользователь {user} успешно ограничен на {duration}\nПричина: {reason}",
  timeout_failed:
    "<:cross:1281580669373382686> Не удалось ограничить пользователя",
};

export const uk = {
  asciilong:
    "<:cross:1281580669373382686> ASCII-текст занадто довгий (понад 8m символів)",
  asciiError:
    "<:cross:1281580669373382686> Сталася помилка під час генерації ASCII-тексту",
  asciiSuccess: "<:check:1281579844089675810> ASCII-текст успішно створено",
  automod_ison:
    "<:cross:1281580669373382686> Це правило Автомодерації вже **увімкнено**\n-# (або досягнуто максимальну кількість правил, або сталася помилка).",
  automod_loading:
    "<:ellipsis:1281582569116143656> Завантаження вашого правила Автомодерації",
  automod_noperms:
    "<:cross:1281580669373382686> Схоже, у мене **немає** дозволу на це. Будь ласка, надайте мені дозвіл **Керувати сервером** або **Адміністратор**",
  automod_success1:
    "<:check:1281579844089675810> Ваше правило Автомодерації створено! Всі лайки будуть заблоковані",
  automod_success2:
    "<:check:1281579844089675810> Ваше правило Автомодерації створено! Всі повідомлення, що містять слово `${word}`, будуть заблоковані",
  automod_success3:
    "<:check:1281579844089675810> Ваше правило Автомодерації створено! Всі повідомлення, підозрювані у спамі, будуть заблоковані",
  automod_success4:
    "<:check:1281579844089675810> Ваше правило Автомодерації створено! Всі повідомлення, підозрювані у спамі згадувань, будуть заблоковані",
  ben: "Бен",
  benNo: "Ні.",
  benYes: "Так.",
  yes: "Так",
  no: "Ні",
  beta: "<:dev:1297262773826486382> Поки недоступно: У розробці",
  boosts: "Бусти",
  btnisntfunc: "Кнопка не працює? Натисніть на посилання! ~>",
  catfail:
    "<:cross:1281580669373382686> На жаль, фото кота не вдалося згенерувати",
  cattitle: "<:check:1281579844089675810> Згенеровано випадкове фото кота",
  cooldown:
    "<:cross:1281580669373382686> Будь ласка, зачекайте, у вас перезарядка для `${command.data.name}`. Ви зможете використати його знову <t:${expiredTimestamp}:R>",
  createdAt: "Створено",
  dayssincelaunch: "Днів з запуску",
  dogfail:
    "<:cross:1281580669373382686> На жаль, фото собаки не вдалося згенерувати",
  dogtitle: "<:check:1281579844089675810> Згенеровано випадкове фото собаки",
  editor: "Редактор",
  emoji: "Емодзі",
  gameApp:
    "<:cross:1281580669373382686> Додатки не можуть грати в Камінь Ножиці Папір",
  gameOnPOnly: "**{player}** та **{opponent}** грають!",
  gameTie: "Нічия",
  gameYS: "<:cross:1281580669373382686> Ви не можете грати в гру самі з собою",
  high: "Високий",
  host: "Хост",
  interr:
    "<:cross:1281580669373382686> Сталася помилка під час виконання цієї команди",
  isApp: "<:cross:1281580669373382686> Ви не можете запустити це з додатками!",
  joinedAt: "Приєднався",
  low: "Низький",
  luckyrandom: "<:luo:1270401166731382867> Вам пощастило!",
  luoxiaohei: "Ло Сяохей",
  luoxiaoheiadd: "Додати",
  luoxiaoheidesc:
    "🎋 Дякуємо за **додавання** Ло Сяохея до дому! ≽^•⩊•^≼ Що вміє Ло Сяохей?\n- **😂 Отримайте свою щоденну дозу цікавих фактів: Використовуйте /fact, щоб згенерувати випадковий цікавий факт!**\n- **🐾 Любителі котів і собак, радійте! Використовуйте /cat для милих фотог��афій котів та /dog для чарівних фотографій цуценят!**\n- **🎲 Відчуваєте себе щасливим? Перевірте свою удачу за допомогою /luck і подивіться, чи зможете ви збігтися з випадковими значеннями!**\n- **🖼️ Покажіть свій профіль: Отримайте свою або чиюсь іншу фотографію профілю за допомогою /profile.**\n- **⏲️ Створюйте користувацькі мітки часу: Розробіть свій власний формат повідомлень з мітками часу за допомогою /timestamp.**\n- **👤Інформація про користувача під рукою: Використовуйте /whois, щоб побачити детальну інформацію про будь-якого користувача.**\n**...і багато іншого! *Скоро з'являться нові функції, няв!***\n\n*Ви можете встановити Ло Сяохея як користувача, але деякі команди не будуть відображатися, що означає, що вони призначені тільки для серверів. Ні, Ло не просить вас входити у свій обліковий запис.*",
  member: "Учасник",
  members: "Учасники",
  mid: "Середній",
  ms: "мс",
  name: "Ім'я",
  nope: "Ні",
  owner: "Власник",
  pinging: "<:ellipsis:1281582569116143656> Пінгую...",
  printdate: "Дата друку",
  purgeSuccess:
    "<:check:1281579844089675810> Успішно очищено кілька з `${fetchedMessages}` повідомлень",
  purge_nomsgs:
    "<:cross:1281580669373382686> Нічого очищати. Повідомлення старші за 2 тижні не можуть бути очищені",
  purge_noperms:
    "<:cross:1281580669373382686> Схоже, у мене **немає** дозволу на це. Будь ласка, надайте мені дозвіл **Керувати повідомленнями** або **Адміністратор**",
  random: "Випадковий",
  release: "Реліз",
  result: "Результат",
  roles: "Ролі",
  rps: "🎮 Камінь Ножиці Папір",
  rpsDesc: "Виберіть свій варіант 💫",
  rpsP: "Папір",
  rpsPick: "Ви вибрали {emoji}",
  rpsR: "Камінь",
  rpsS: "Ножиці",
  rpsTimeout:
    "<:cross:1281580669373382686> **{opponent}** не вибрав варіант протягом 60 секунд - Гру скасовано",
  rpsWin: "**{player}** виграв гру!",
  solution: "Рішення",
  srvCreation: "Дата створення",
  time_1desc: "Час",
  time_1label: "1 січня 1970",
  time_2desc: "Повний час",
  time_2label: "1 січня 1970, 00:00",
  time_3desc: "Цифрова дата",
  time_3label: "Четвер, 1 січня 1970, 00:00",
  time_4desc: "Дата",
  time_4label: "55 років тому",
  time_5desc: "Дата та час",
  time_6desc: "Повна дата",
  time_7desc: "Минулий час",
  timeplaceholder: "Виберіть формат часу",
  tttGOver: "Гра закінчена",
  tttStatus: "Статус",
  tttTimeout: "**{opponent}** занадто довго вибирав",
  tttTitle: "Хрестики-нулики",
  tttTurn: "{emoji} | Хід: **{player}**",
  tttWin: "{emoji} | **{player}** виграв!",
  unluckyrandom: "<:luo:1270401166731382867> Так не пощастило...",
  userNotFound: "<:cross:1281580669373382686> Невідомий користувач",
  veriflvl: "Рівень верифікації",
  veryhigh: "Дуже високий",
  wordleErr:
    "<:cross:1281580669373382686> О ні, сталася помилка. Це тому що:\nВідповідь ще не створена! Завжди видно код як `404`.\nВказана невірна дата\nЗанадто багато запитів, зачекайте деякий час і спробуйте знову",
  joinusdesc:
    '**≽^•⩊•^≼ | Це правильно! Ви в правильному місці! Це офіційний сервер з дискорд-додатком під назвою "Luo Xiaohei"**',
  viewBalance:
    "<:wallet:1297262403691745280> {user} має на своєму кошику: **{balance}¥**",
  viewSelfBalance: "<:wallet:1297262403691745280> Ваш баланс: **{balance}¥**",
  inventoryTitle: "Інвентар {user}",
  inventoryEmpty: "<:cross:1281580669373382686> Цей інвентар порожній!",
  transferSuccess:
    "<:check:1281579844089675810> Успішно переведено **{amount}¥** в **{user}**",
  transferInsufficientBalance:
    "<:cross:1281580669373382686> У вас недостатньо балансу для переводу",
  transferInvalidAmount: "<:cross:1281580669373382686> Неправильна кількість",
  transferConfirmTitle: "Підтвердження переводу",
  transferConfirmDescription:
    "Ви впевнені, що хочете перевести **{amount}¥** в **{user}**?",
  transferCancelled: "<:cross:1281580669373382686> Перевод скасовано",
  transferTimeout: "<:cross:1281580669373382686> Перевод просрочен",
  transferSameUser:
    "<:cross:1281580669373382686> Ви не можете перевести гроші собі",
  transferBot:
    "<:cross:1281580669373382686> Ви не можете перевести гроші ботам",
  transferError:
    "<:cross:1281580669373382686> Сталася помилка під час переводу грошей",
  itemNotFound: "<:cross:1281580669373382686> Предмет не знайдено",
  notEnoughBalance:
    "<:cross:1281580669373382686> У вас недостатньо балансу для покупки цього предмета",
  itemPurchased: "<:check:1281579844089675810> Ви успішно купили **{item}**",
  ldNoUsersFound: "Нікого немає на лідері",
  ldTitle: "Лідер за грошима",
  ldDescription: "10 найбагатших користувачів:",
  inventoryError:
    "<:cross:1281580669373382686> Сталася помилка під час отримання інвентаря",
  purchaseError:
    "<:cross:1281580669373382686> Сталася помилка під час покупки предмета",
  itemDisabled:
    "<:cross:1281580669373382686> Цей предмет у даний час недоступний для покупки",
  isRegistered: "Зареєстрований?",
  balance: "Баланс",
  databaseError:
    "Сталася помилка під час отримання даних користувача. Будь ласка, спробуйте пізніше",
  inventorySize: "Розмір інвентаря",
  inventoryFull:
    "Ваш інвентар заповнений. Ви не можете купити більше предметів, поки не взаємодіяти з предметами для отримання більшого простору",
  itemNotInInventory: "У вас немає цього предмета в інвентарі",
  notEnoughItems: "У вас недостатньо цього предмета для продажу",
  saleError:
    "Сталася помилка під час продажу предмета. Будь ласка, спробуйте пізніше",
  itemSold: "Предмет проданий",
  soldAmount: "Количество",
  soldPrice: "Цена",
  itemSoldDescription: "{amount}x {item} було продано за {price}¥",
  itemPurchasedDescription: "{amount}x {item} було куплено за {price}¥",
  anonymousEnabled: "Ви тепер анонімний на таблиці лідерів",
  anonymousDisabled: "Ви більше не анонімний на таблиці лідерів",
  servercount: "Кількість серверів",
  membercount: "Кількість учасників",
  cannot_ban_user:
    "<:cross:1281580669373382686> Я не можу заблокувати цього користувача. Будь ласка, перевірте мої дозволи",
  cannot_ban_higher_role:
    "<:cross:1281580669373382686> Ви не можете заблокувати когось з рівною або вищою роллю",
  ban_success:
    "<:check:1281579844089675810> Успішно заблоковано {user}\nПричина: {reason}\nВидалені повідомлення за останні {days} днів",
  ban_failed:
    "<:cross:1281580669373382686> Не вдалося заблокувати користувача. Будь ласка, перевірте мої дозволи та спробуйте ще раз",
  user_not_in_server:
    "<:cross:1281580669373382686> Цей користувач не знаходиться на сервері",
  cannot_kick_user:
    "<:cross:1281580669373382686> Я не можу викинути цього користувача. Будь ласка, перевірте мої права",
  cannot_kick_higher_role:
    "<:cross:1281580669373382686> Ви не можете викинути когось з рівною або вищою роллю",
  kick_success:
    "<:check:1281579844089675810> Успішно викинуто {user}\nПричина: {reason}",
  kick_failed:
    "<:cross:1281580669373382686> Не вдалося викинути користувача. Будь ласка, перевірте мої права та спробуйте знову",
  invalid_duration_format:
    "<:cross:1281580669373382686> Невірний формат тривалості. Використовуйте формат: 1m, 1h, 1d",
  duration_too_long:
    "<:cross:1281580669373382686> Тривалість обмеження не може перевищувати 28 днів",
  cannot_timeout_user:
    "<:cross:1281580669373382686> Я не можу обмежити цього користувача",
  cannot_timeout_higher_role:
    "<:cross:1281580669373382686> Ви не можете обмежити учасника з вищою або рівною роллю",
  timeout_success:
    "<:check:1281579844089675810> Користувач {user} успішно обмежений на {duration}\nПричина: {reason}",
  timeout_failed:
    "<:cross:1281580669373382686> Не вдалося обмежити користувача",
};

export const ja = {
  asciilong:
    "<:cross:1281580669373382686> ASCIIテキストが長すぎます（8m文字以上）",
  asciiError:
    "<:cross:1281580669373382686> ASCIIテキストの生成中にエラーが発生しました",
  asciiSuccess:
    "<:check:1281579844089675810> ASCIIテキストが正常に生成されました",
  automod_ison:
    "<:cross:1281580669373382686> この自動モデレーションルールはすでに**オン**に設定されています\n-#（ルールの最大数に達したか、エラーが発生しています）",
  automod_loading:
    "<:ellipsis:1281582569116143656> 自動モデレーションルールを読み込んでいます",
  automod_noperms:
    "<:cross:1281580669373382686> それを行う権限が**ありません**。**サーバーの管理**または**管理者**権限を付与してください",
  automod_success1:
    "<:check:1281579844089675810> 自動モデレーションルールが作成されました！すべての悪口がブロックされます",
  automod_success2:
    "<:check:1281579844089675810> 自動モデレーションルールが作成されました！`${word}`という単語を含むすべてのメッセージがブロックされます",
  automod_success3:
    "<:check:1281579844089675810> 自動モデレーションルールが作成されました！スパムの疑いのあるすべてのメッセージがブロックされます",
  automod_success4:
    "<:check:1281579844089675810> 自動モデレーションルールが作成されました！メンションスパムの疑いのあるすべてのメッセージがブロックされます",
  ben: "ベン",
  benNo: "いいえ",
  benYes: "はい",
  yes: "はい",
  no: "いいえ",
  beta: "<:dev:1297262773826486382> まだ利用できません：開発中です",
  boosts: "ブースト",
  btnisntfunc:
    "ボタンが機能しませんか？代わりにリンクをクリックしてください！ ~>",
  catfail:
    "<:cross:1281580669373382686> 残念ながら、猫の写真を生成できませんでした",
  cattitle: "<:check:1281579844089675810> ランダムな猫の写真を生成しました",
  cooldown:
    "<:cross:1281580669373382686> お待ちください。`${command.data.name}`のクールダウン中です。<t:${expiredTimestamp}:R>に再度使用できます",
  createdAt: "作成日",
  dayssincelaunch: "開始からの日数",
  dogfail:
    "<:cross:1281580669373382686> 残念ながら、犬の写真を生成できませんでした",
  dogtitle: "<:check:1281579844089675810> ランダムな犬の写真を生成しました",
  editor: "エディター",
  emoji: "絵文字",
  gameApp: "<:cross:1281580669373382686> アプリはじゃんけんをプレイできません",
  gameOnPOnly: "**{player}**と**{opponent}**がプレイ中です！",
  gameTie: "引き分け",
  gameYS:
    "<:cross:1281580669373382686> 自分自身とゲームをプレイすることはできません",
  high: "高",
  host: "ホスト",
  interr:
    "<:cross:1281580669373382686> このコマンドの実行中にエラーが発生しました",
  isApp:
    "<:cross:1281580669373382686> アプリでこれを実行することはできません！",
  joinedAt: "参加日",
  low: "低",
  luckyrandom: "<:luo:1270401166731382867> ラッキーです！",
  luoxiaohei: "ロシャオヘイ",
  luoxiaoheiadd: "追加",
  luoxiaoheidesc:
    "🎋 ロシャオヘイをホームに**追加**していただきありがとうございます！ ≽^•⩊•^≼ ロシャオヘイは何ができるのでしょうか？\n- **😂 日々のトリビアを取得：/factを使用してランダムな面白い事実を生成！**\n- **🐾 猫＆犬好きの皆さん、喜んでください！/catで可愛い猫の写真、/dogで素敵な子犬の写真を！**\n- **🎲 運試しをしたい？/luckを使ってランダムな値と結果の値が一致するかテスト！**\n- **🖼️ プロフィールを自慢：/profileであなたや他の人のプロフィール画像を取得。**\n- **⏲️ カスタムタイムスタンプを作成：/timestampで独自のタイムスタンプ形式のメッセージをデザイン。**\n- **👤ユーザー情報を手元に：/whoisを使用して任意のユーザーの詳細情報を確認。**\n**...そしてもっと！*新機能が近日登場予定、ニャー！***\n\n*ロシャオヘイをユーザーとしてインストールできますが、一部のコマンドは表示されません。これらはギルド専用です。ロシャオヘイはあなたのアカウントへのログインを要求しません。*",
  member: "メンバー",
  members: "メンバー",
  mid: "中",
  ms: "ミリ秒",
  name: "名前",
  nope: "いいえ",
  owner: "オーナー",
  pinging: "<:ellipsis:1281582569116143656> Ping中...",
  printdate: "印刷日",
  purgeSuccess:
    "<:check:1281579844089675810> `${fetchedMessages}`件のメッセージの中から一部を正常に削除しました",
  purge_nomsgs:
    "<:cross:1281580669373382686> 削除するメッセージがありません。2週間以上前のメッセージは削除できません",
  purge_noperms:
    "<:cross:1281580669373382686> それを行う権限が**ありません**。**メッセージの管理**または**管理者**権限を付与してください",
  random: "ランダム",
  release: "リリース",
  result: "結果",
  roles: "役割",
  rps: "🎮 じゃんけん",
  rpsDesc: "選択してください 💫",
  rpsP: "パー",
  rpsPick: "あなたの選択：{emoji}",
  rpsR: "グー",
  rpsS: "チョキ",
  rpsTimeout:
    "<:cross:1281580669373382686> **{opponent}**が60秒以上選択しなかったため、ゲームはキャンセルされました",
  rpsWin: "**{player}**が勝利しました！",
  solution: "解決策",
  srvCreation: "作成日",
  time_1desc: "時間",
  time_1label: "1970年1月1日",
  time_2desc: "完全な時間",
  time_2label: "1970年1月1日 00:00",
  time_3desc: "デジタル日付",
  time_3label: "1970年1月1日木曜日 00:00",
  time_4desc: "日付",
  time_4label: "55年前",
  time_5desc: "日付と時間",
  time_6desc: "完全な日付",
  time_7desc: "経過時間",
  timeplaceholder: "時間形式を選択",
  tttGOver: "ゲーム終了",
  tttStatus: "ステータス",
  tttTimeout: "**{opponent}**の選択に時間がかかりすぎました",
  tttTitle: "三目並べ",
  tttTurn: "{emoji} | ターン：**{player}**",
  tttWin: "{emoji} | **{player}**が勝利しました！",
  unluckyrandom: "<:luo:1270401166731382867> 運が悪いですね...",
  userNotFound: "<:cross:1281580669373382686> 不明なユーザー",
  veriflvl: "認証レベル",
  veryhigh: "非常に高い",
  wordleErr:
    "<:cross:1281580669373382686> エラーが発生しました。理由：\n**回答**がまだ作成されていません！常に`404`というコードが表示されます。\n無効な日付が指定されました\nリクエストが多すぎます。しばらく待ってから再試行してください",
  joinusdesc:
    '**≽^•⩊•^≼ | そうです！正しい場所にいます！これは"Luo Xiaohei"という名前のDiscordアプリの公式サーバーです**',
  viewBalance: "<:wallet:1297262403691745280> {user}の財布残高：**{balance}¥**",
  viewSelfBalance:
    "<:wallet:1297262403691745280> あなたの財布残高：**{balance}¥**",
  inventoryTitle: "{user}のインベントリ",
  inventoryEmpty: "<:cross:1281580669373382686> このインベントリは空です！",
  transferSuccess:
    "<:check:1281579844089675810> **{amount}¥**を**{user}**に正常に転送しました",
  transferInsufficientBalance:
    "<:cross:1281580669373382686> 転送するのに十分な残高がありません",
  transferInvalidAmount: "<:cross:1281580669373382686> 無効な金額",
  transferConfirmTitle: "転送の確認",
  transferConfirmDescription:
    "**{amount}¥**を**{user}**に転送してもよろしいですか？",
  transferCancelled: "<:cross:1281580669373382686> 転送がキャンセルされました",
  transferTimeout: "<:cross:1281580669373382686> 転送がタイムアウトしました",
  transferSameUser:
    "<:cross:1281580669373382686> 自分自身にお金を転送することはできません",
  transferError:
    "<:cross:1281580669373382686> お金の転送中にエラーが発生しました",
  transferBot:
    "<:cross:1281580669373382686> ボットにお金を転送することはできません",
  itemNotFound: "<:cross:1281580669373382686> アイテムが見つかりません",
  notEnoughBalance:
    "<:cross:1281580669373382686> このアイテムを購入するのに十分な残高がありません",
  itemPurchased: "<:check:1281579844089675810> **{item}**を正常に購入しました",
  ldNoUsersFound: "リーダーボードにユーザーが見つかりません",
  ldTitle: "通貨リーダーボード",
  ldDescription: "トップ10の最も裕福なユーザー：",
  inventoryError:
    "<:cross:1281580669373382686> インベントリの取得中にエラーが発生しました",
  purchaseError:
    "<:cross:1281580669373382686> アイテムの購入中にエラーが発生しました",
  itemDisabled: "<:cross:1281580669373382686> このアイテムは現在購入できません",
  isRegistered: "登録済み？",
  balance: "残高",
  databaseError:
    "ユーザーデータの取得中にエラーが発生しました。後でもう一度お試しください",
  inventorySize: "インベントリサイズ",
  inventoryFull:
    "インベントリがいっぱいです。アイテムとのインタラクションでスペースを確保するまで、これ以上アイテムを購入できません",
  itemNotInInventory: "このアイテムはあなたのインベントリにありません",
  notEnoughItems: "販売するのに十分な量のこのアイテムがありません",
  saleError:
    "アイテムの販売中にエラーが発生しました。後でもう一度お試しください",
  itemSold: "アイテムを販売しました",
  soldAmount: "販売数量",
  soldPrice: "販売価格",
  itemSoldDescription: "{amount}x {item}を{price}¥で販売しました",
  itemPurchasedDescription: "{amount}x {item}を{price}¥で購入しました",
  anonymousEnabled: "リーダーボードで匿名になりました",
  anonymousDisabled: "リーダーボードでの匿名状態が解除されました",
  servercount: "サーバー数",
  membercount: "メンバー数",
  cannot_ban_user:
    "<:cross:1281580669373382686> このユーザーをバンすることはできません。私の権限を確認してください。",
  cannot_ban_higher_role:
    "<:cross:1281580669373382686> 同じかそれ以上の役割を持つユーザーをバンすることはできません。",
  ban_success:
    "<:check:1281579844089675810> {user}を正常にバンしました\n理由: {reason}\n最後の{days}日のメッセージを削除しました",
  ban_failed:
    "<:cross:1281580669373382686> ユーザーのバンに失敗しました。私の権限を確認して、もう一度お試しください。",
  user_not_in_server:
    "<:cross:1281580669373382686> このユーザーはサーバーにいません",
  cannot_kick_user:
    "<:cross:1281580669373382686> このユーザーをキックすることはできません。私の権限を確認してください",
  cannot_kick_higher_role:
    "<:cross:1281580669373382686> 同じかそれ以上の役割を持つユーザーをキックすることはできません",
  kick_success:
    "<:check:1281579844089675810> {user}を正常にキックしました\n理由: {reason}",
  kick_failed:
    "<:cross:1281580669373382686> ユーザーのキックに失敗しました。私の権限を確認して、もう一度お試しください",
  invalid_duration_format:
    "<:cross:1281580669373382686> 無効な期間形式です。1m、1h、1dのような形式を使用してください",
  duration_too_long:
    "<:cross:1281580669373382686> タイムアウト期間は28日を超えることはできません",
  cannot_timeout_user:
    "<:cross:1281580669373382686> このユーザーをタイムアウトすることはできません",
  cannot_timeout_higher_role:
    "<:cross:1281580669373382686> より高いまたは同等の役職を持つメンバーをタイムアウトすることはできません",
  timeout_success:
    "<:check:1281579844089675810> {user}を{duration}の間タイムアウトしました\n理由: {reason}",
  timeout_failed:
    "<:cross:1281580669373382686> ユーザーのタイムアウトに失敗しました",
};
